* Elisp
  #+BEGIN_SRC emacs-lisp
(defun aod.org/src-block-content (name)
  (save-excursion
    (goto-char (org-babel-find-named-block name))
    (let ((src (org-element-property :value (org-element-at-point))))
      src)))
  #+END_SRC

  #+RESULTS:
  : aod\.org/src-block-content

* Getting started

  #+NAME: make_template
  #+BEGIN_EXAMPLE c :var C_TYPE="bool"
s7_pointer C_TYPE_make(s7_scheme *sc, s7_pointer args) {
     C_TYPE* data = new C_TYPE;
     ,*data = (C_TYPE*) S7_READ(sc, s7_car(args));
     int type = s7_integer(s7_eval_c_string(sc, "(*c-primitives* 'type-C_TYPE)"));
     s7_pointer obj = s7_make_c_object(sc, type, (void*) data);
     return obj;
}
  #+END_EXAMPLE

  #+NAME: make_template_src
  #+BEGIN_SRC c
s7_pointer C_TYPE_make(s7_scheme *sc, s7_pointer args) {
     C_TYPE* data = new C_TYPE;
     ,*data = (C_TYPE*) S7_READ(sc, s7_car(args));
     int type = s7_integer(s7_eval_c_string(sc, "(*c-primitives* 'type-C_TYPE)"));
     s7_pointer obj = s7_make_c_object(sc, type, (void*) data);
     return obj;
}
  #+END_SRC


  #+NAME: template_primitive
  #+BEGIN_SRC c
s7_pointer C_TYPE_make(s7_scheme *sc, s7_pointer args) {
     C_TYPE* data = new C_TYPE;
     ,*data = (C_TYPE*) S7_READ(sc, s7_car(args));
     int type = s7_integer(s7_eval_c_string(sc, "(*c-primitives* 'type-C_TYPE)"));
     s7_pointer obj = s7_make_c_object(sc, type, (void*) data);
     return obj;
}

s7_pointer C_TYPE_ref(s7_scheme *sc, s7_pointer args) {
	C_TYPE* data = (C_TYPE*) s7_c_object_value(s7_car(args));

	return S7_MAKE(sc, *data);
}

s7_pointer C_TYPE_set(s7_scheme *sc, s7_pointer args) {
	// 2 args: (block-set! (ref) value)
	if (s7_list_length(sc, args) != 2) {
		return (s7_wrong_number_of_args_error(sc,
				"C_TYPE-set! takes 2 arguments: ~S", args));
	}
	C_TYPE* data = (C_TYPE*) s7_c_object_value(s7_car(args));
	s7_pointer s7_new_value = s7_cadr(args);
	C_TYPE new_value = S7_READ(sc, s7_new_value);
	,*data = new_value;

	return (s7_new_value);
}
  #+END_SRC

  #+NAME: make
  #+BEGIN_SRC emacs-lisp :var template="make_template_src" type="bool" s7_read="S7_boolean" :results value c
(-as-> (aod.org/src-block-content template) x
       (replace-regexp-in-string "C_TYPE" type x t)
       (replace-regexp-in-string "S7_READ" s7_read x t)
       )
  #+END_SRC

  #+RESULTS: make
  : s7_pointer bool_make(s7_scheme *sc, s7_pointer args) {
  :      bool* data = new bool;
  :      *data = (bool*) S7_boolean(sc, s7_car(args));
  :      int type = s7_integer(s7_eval_c_string(sc, "(*c-primitives* 'type-bool)"));
  :      s7_pointer obj = s7_make_c_object(sc, type, (void*) data);
  :      return obj;
  : }

  #+BEGIN_SRC c :noweb yes
<<make(type="bool", s7_read="s7_boolean")>>
<<make(type="int", s7_read="s7_number_to_integer")>>
  #+END_SRC


  Gives
  #+BEGIN_SRC c
s7_pointer bool_make(s7_scheme *sc, s7_pointer args) {
     bool* data = new bool;
     ,*data = (bool*) s7_boolean(sc, s7_car(args));
     int type = s7_integer(s7_eval_c_string(sc, "(*c-primitives* 'type-bool)"));
     s7_pointer obj = s7_make_c_object(sc, type, (void*) data);
     return obj;
}

s7_pointer int_make(s7_scheme *sc, s7_pointer args) {
     int* data = new int;
     ,*data = (int*) s7_number_to_integer(sc, s7_car(args));
     int type = s7_integer(s7_eval_c_string(sc, "(*c-primitives* 'type-int)"));
     s7_pointer obj = s7_make_c_object(sc, type, (void*) data);
     return obj;
}
  
  #+END_SRC
